/*****************************************************************************
** 文件名称：check.h   
** 功    能：
** 修改日志：
******************************************************************************/
#ifndef __CHECK_H
#define __CHECK_H

/*******************************************************************************
** 函数声明
*******************************************************************************/
uchar check_bit(uchar *tx_data,uint length);
ushort CRC_16(uchar *PuchMsg,ushort usDataLen);

unsigned char RxCheck(unsigned char *rx_data);

#endif

